{
	"comment": "This is an example config. Fill out this information as described and rename this file 'config.json'. You may want to first add your bot to a (test) server, as described here: https://discordjs.guide/preparations/adding-your-bot-to-servers.html.",
	"token": "This is essentially your bot's credentials - its equivalent to a username and password. First, set up your bot as described here: https://discordjs.guide/preparations/setting-up-a-bot-application.html. Then, go to https://discord.com/developers/applications/. Select your bot application. Click 'Bot' in the left sidebar, then click the 'Copy' button under the 'Token' section. Paste that here.",
	"clientId": "This identifies your bot as a user. After setting up your bot, open up its application page, then click 'OAuth2' in the left sidebar. Click the 'Copy' button under the 'CLIENT ID' section. Paste that here.",
	"masterUserId": "This is the id of a user who you want to have full privileges/permissions for all commands. Usually that's you, the owner of the bot. Within your normal Discord window, go to 'My Account' under your User Settings. Click the 3 dots next to your username at the top, then click 'Copy ID'. Paste that here.",
	"guildIds": ["This is an array of the ids of the guilds you have added your bot to. Within your normal Discord window, open your Settings. In the left sidebar, click 'Advanced'. Enable the 'Developer Mode' switch if you haven't already. Then, close the Settings. In the server bar, right click the server you want to add/have added your bot to. At the bottom of the right-click-menu, click 'Copy ID'. Paste that here."],
	"developmentGuildId": "This is the id of a single guild which you've added your bot to, and which you want to function as your development guild. Commands which export`inDevelopment: true` are added only to this guild, and not to the guilds listed in the guildIds array, but all commands always are added to the development guild, even if it's not listed in the guildIds array."
}
